In [1]:
import pandas as pd

In [3]:
df = pd.read_excel("../input/Blast Whatsapp Seminar TD-MII-Cloudera 18 July 24.xlsx")
df.head()

  Contact/Title/Title Contact/First Name Contact/Last Name Contact/Mobile
0                  Ms            Fitriah               NaN  0858 14807700
1                  Mr              Rizqi               NaN  0857 94503652
2                  Ms              Helma               NaN   0812 9941155
3                  Mr          Agustinus         Agustinus            NaN
4                  Mr               Rudi              Rudi            NaN

In [4]:
# Remove all whitespaces
df["Contact/Mobile"] = df["Contact/Mobile"].str.replace(" ", "")
# Add +62 prefix to all Contact/Mobile numbers

df["Contact/Mobile"] = df["Contact/Mobile"].str.replace("-", "")
# Remove the first "0" if it exists
df["Contact/Mobile"] = df["Contact/Mobile"].str.lstrip("0")

# Add +62 prefix to all Contact/Mobile numbers
df["Contact/Mobile"] = "+62" + df["Contact/Mobile"]

df.dropna(subset=['Contact/Mobile'], inplace=True)
df.fillna('', inplace=True)


df.head()

  Contact/Title/Title Contact/First Name Contact/Last Name  Contact/Mobile
0                  Ms            Fitriah                    +6285814807700
1                  Mr              Rizqi                    +6285794503652
2                  Ms              Helma                     +628129941155
3                  Mr          Agustinus         Agustinus
4                  Mr               Rudi              Rudi

In [5]:
df.to_excel("../input/fixed.xlsx", index=False)